src/cf/Catalogs/ПапкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПапкиФайлов</Name>
			<Comment>Структура папок для хранения файлов</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание папки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный за папку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания папки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДескрипторыДляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДескрипторыДляОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолученОт</Name>
					<Comment>Все типы из измерения "Объект", плюс Предмет из справочника "ЗаписиРабочегоКалендаря"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.СпискиРассылкиПоКонтрагентам</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаВССТУ</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныйКонтейнерЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.Резолюции</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаметкиДокументооборота</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГруппКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФорума</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаДелВАрхив</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УничтожениеДел</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗадач</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.СпискиРассылкиПоКонтрагентам</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаВССТУ</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныйКонтейнерЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.Резолюции</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГруппКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФорума</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаДелВАрхив</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УничтожениеДел</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗадач</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДескриптора</Name>
					<Comment>0 - основной; 1 - по рабочей группе; 2 - индивидуальный; 3 - от владельца; 4 - для локальных администраторов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПапкиФайлов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей папки файлов
//
// Возвращаемое значение:
//   Структура
//     Родитель
//     Наименование
//     Описание
//     Ответственный
//     ДатаСоздания
//
Функция ПолучитьСтруктуруПапки() Экспорт
	
	ПараметрыПапки = Новый Структура;
	ПараметрыПапки.Вставить("Родитель");
	ПараметрыПапки.Вставить("Наименование");
	ПараметрыПапки.Вставить("Описание");
	ПараметрыПапки.Вставить("Ответственный");
	ПараметрыПапки.Вставить("ДатаСоздания");
	
	Возврат ПараметрыПапки;
	
КонецФункции

// Создает и записывает в БД папку файлов
//
// Параметры:
//   СтруктураПапкиФайлов - Структура - структура полей папки.
//
// Возвращаемое значение - ссылка на созданную папку
//
Функция СоздатьПапку(СтруктураПапкиФайлов) Экспорт
	
	НоваяПапка = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяПапка, СтруктураПапкиФайлов);
	НоваяПапка.Записать();
	
	Возврат НоваяПапка.Ссылка;
	
КонецФункции

// Проверяет, подходит ли объект к шаблону процесса
Функция ШаблонПодходитДляАвтозапускаБизнесПроцессаПоОбъекту(ШаблонСсылка, ПредметСсылка, Подписчик, ВидСобытия, Условие) Экспорт
	
	Возврат БизнесСобытияВызовСервера.ШаблонПодходитДляАвтозапускаБизнесПроцессаПоПредмету(ШаблонСсылка, 
		ПредметСсылка, Подписчик, ВидСобытия, Условие);
	
КонецФункции

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	РедактируемыеРеквизиты.Добавить("Описание");
	РедактируемыеРеквизиты.Добавить("Ответственный");
	РедактируемыеРеквизиты.Добавить("ДатаСоздания");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Начальное заполнение

Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника ПапкиФайлов.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника УчетныеЗаписиЭлектроннойПочты.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных        = "Шаблоны";
	Элемент.Наименование                     = НСтр("ru = 'Шаблоны файлов'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ДатаСоздания = ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_УправлениеДоступом

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ЗначенияРеквизитовОбъекта()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка";
	
КонецФункции

// Заполняет переданный дескриптор доступа 
Процедура ЗаполнитьОсновнойДескриптор(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДокументооборотПраваДоступа.ЗаполнитьНастройкиДескриптора(ДескрипторДоступа, ОбъектДоступа);

КонецПроцедуры	

// Проверяет наличие метода.
// 
Функция ЕстьМетодПраваСотрудниковПоФайлам() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает права доступа сотрудников к указанным файлам.
// 
Функция ПраваСотрудниковПоФайлам(Файлы, СотрудникиОтбор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаПрав = ДокументооборотПраваДоступа.ТаблицаПравСотрудниковПоОбъектам();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	ДескрипторыДляОбъектов.Дескриптор КАК ДескрипторПапки
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПапкиФайлов КАК ПапкиФайлов
		|		ПО Файлы.ВладелецФайла = ПапкиФайлов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|		ПО ПапкиФайлов.Ссылка = ДескрипторыДляОбъектов.Объект
		|ГДЕ
		|	Файлы.Ссылка В(&Файлы)");
	
	Запрос.УстановитьПараметр("Файлы", Файлы);
	
	ТаблицаФайловСДескрипторами = Запрос.Выполнить().Выгрузить();
	ТаблицаФайловСДескрипторами.Индексы.Добавить("ДескрипторПапки");
	
	Дескрипторы = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		Дескрипторы, ТаблицаФайловСДескрипторами.ВыгрузитьКолонку("ДескрипторПапки"));
	
	// Получение прав по дескрипторам папок, но по правилам обработки для файлов.
	Запрос = Новый Запрос;
	Запрос = Справочники.ПапкиФайлов.ЗапросДляРасчетаПрав(
		Дескрипторы,
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.ПапкиФайлов),
		Справочники.ПапкиФайлов);
		
	Если СотрудникиОтбор <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ПО НовыеПрава.Сотрудник = СоставСубъектовПравДоступа.Субъект",
			"ПО НовыеПрава.Сотрудник = СоставСубъектовПравДоступа.Субъект
			|И СоставСубъектовПравДоступа.Сотрудник В (&СотрудникиОтбор)");
	КонецЕсли;
	
	ПравилаОбработкиНастроекПапки = Справочники.Файлы.ПолучитьПравилаОбработкиНастроекПравПапки();
	Запрос.УстановитьПараметр("ПравилаОбработкиНастроекПапки", ПравилаОбработкиНастроекПапки);
	Запрос.УстановитьПараметр("СотрудникиОтбор", СотрудникиОтбор);
	
	ВыборкаПоДескрипторам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДескрипторам.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("ДескрипторПапки", ВыборкаПоДескрипторам.Дескриптор);
		СтрокиФайлов = ТаблицаФайловСДескрипторами.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаФайла Из СтрокиФайлов Цикл
			
			Выборка = ВыборкаПоДескрипторам.Выбрать();
			Пока Выборка.Следующий() Цикл
				Стр = ТаблицаПрав.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, Выборка);
				Стр.ОбъектДоступа = СтрокаФайла.Файл;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИдентификаторОМ = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.Файлы);
	ДокументооборотПраваДоступа.РасширитьТаблицуПравНеограниченнымиПравами(
		ТаблицаПрав, ИдентификаторОМ, Файлы, СотрудникиОтбор);
	
	Возврат ТаблицаПрав;
	
КонецФункции

// Возвращает признак того, что менеджер содержит метод ЗапросДляРасчетаПрав()
// 
Функция ЕстьМетодЗапросДляРасчетаПрав() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает запрос для расчета прав доступа по дескрипторам объекта
// 
// Параметры:
//  
//  Дескрипторы - Массив - массив дескрипторов, чьи права нужно рассчитать
//  ИдОбъекта - Ссылка - идентификатор объекта метаданных, назначенный переданным дескрипторам
//  МенеджерОбъектаДоступа - СправочникМенеджер, ДокументМенеджер - менеджер объекта доступа
// 
// Возвращаемое значение - Запрос - запрос, который выберет права доступа для переданного массива дескрипторов
// 
Функция ЗапросДляРасчетаПрав(Дескрипторы, ИдОбъекта, МенеджерОбъектаДоступа) Экспорт
	
	Запрос = Справочники.ДескрипторыДоступаОбъектов.ЗапросДляСтандартногоРасчетаПрав(
		Дескрипторы, ИдОбъекта, МенеджерОбъектаДоступа, Истина, Ложь);
	Запрос.Текст = ДокументооборотПраваДоступаПовтИсп.ТекстЗапросаДляРасчетаПравПапок();
	
	Возврат Запрос;
	
КонецФункции

// Заполняет протокол расчета прав дескрипторов
// 
// Параметры:
//  
//  ПротоколРасчетаПрав - Массив - протокол для заполнения
//  ЗапросПоПравам - Запрос - запрос, который использовался для расчета прав дескрипторов
//  Дескрипторы - Массив - массив дескрипторов, чьи права были рассчитаны
//  
Процедура ЗаполнитьПротоколРасчетаПрав(ПротоколРасчетаПрав, ЗапросПоПравам) Экспорт
	
	Справочники.ДескрипторыДоступаОбъектов.ЗаполнитьПротоколРасчетаПравСтандартно(
		ПротоколРасчетаПрав, ЗапросПоПравам);
	
КонецПроцедуры

Функция ЕстьМетодПолучитьПравилаОбработкиНастроекПравПапки() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает таблицу значений с правилами обработки настроек прав папки,
// которые следует применять для расчета прав объекта
// 
Функция ПолучитьПравилаОбработкиНастроекПравПапки() Экспорт
	
	ТаблицаПравил = ДокументооборотПраваДоступа.ТаблицаПравилОбработкиНастроекПапки();
	
	Стр = ТаблицаПравил.Добавить();
	Стр.Настройка = "ЧтениеПапокИФайлов";
	Стр.Чтение = Истина;
	
	Стр = ТаблицаПравил.Добавить();
	Стр.Настройка = "ИзменениеПапок";
	Стр.Добавление = Истина;
	Стр.Изменение = Истина;
	Стр.Удаление = Истина;
	
	Стр = ТаблицаПравил.Добавить();
	Стр.Настройка = "УправлениеПравами";
	Стр.УправлениеПравами = Истина;
	
	Возврат ТаблицаПравил;
	
КонецФункции

#КонецОбласти

#КонецЕсли
